{
    "content": [
        "Monday’s trading session saw crypto futures traders lose over $500 million in liquidations positions as steep volatility impacted highly leveraged longs and shorts, with some majors dropping as much as 12%.",
        "Bitcoin (BTC) whipsawed from $43,000 to as low as $40,300, data shows, leading drops across major tokens such as Chainlink (LINK), Cardano’s ADA and Solana’s SOL, which dropped over 8% before slightly recovering.",
        "Generally riskier bets shiba inu (SHIB) and dogecoin (DOGE), two dog-themed meme tokens, fared slightly better with a 5% drop. Meanwhile, BNB Chain’s BNB, Avalanche’s AVAX, and Celestia’s TIA showed strength with gains of as much as 20% – unaffected by weakness in bitcoin."
        "Today, the Financial Accounting Standards Board (FASB) announced new rules requiring companies to account for cryptocurrencies like Bitcoin at fair value. These rules are set to take effect on December 15, 2024, with the option for earlier application.",
        "Under these first-of-their-kind guidelines in the U.S., businesses must disclose cryptocurrency values based on market prices at the end of each reporting period. This move aims for greater transparency and accuracy in financial reporting due to the volatile nature of digital assets like Bitcoin.",
        "Previously, Bitcoin was treated as an intangible asset, requiring impairment charges for price drops below purchase value but not allowing book benefits for price increases unless sold. The new fair value accounting allows companies to report unrealized gains and losses quarterly, potentially encouraging more companies to add Bitcoin to their balance sheets without needing to sell for book appreciation.",
        "Edward McGee, CFO of Grayscale Investments LLC, commented on the timing of this announcement as a 'phenomenal holiday gift of commonsense accounting.'",
        "This change promises investors and regulators more timely and accurate company financial health insights, especially for those holding Bitcoin. It aims to build trust in an industry often criticized for its regulatory oversight and transparency issues.",
        "Implementing fair value accounting for cryptocurrencies poses challenges due to Bitcoin's volatility. Companies will need robust valuation methods, and auditors must develop expertise in assessing fair market value, a complex task.",
        "Despite these challenges, the introduction of fair value accounting rules for Bitcoin and other cryptocurrencies marks a significant advancement for the industry."
    ]
}
